package com.perlina.java.foundational.operator.bit;

/**
 * 按位取反
 *
 * @author: Perlina
 * @version:2021/8/218:52 PM
 */
public class BitNotOperator {
    public static void main(String[] args) {
        //按位取反
        System.out.println((~245));

        /**
         * 计算过程：
         * 245： 0000 0000 0000 0000 0000 0000 1111 0101
         * ～ ： 1111 1111 1111 1111 1111 1111 0000 1010
         * 补码转反码
         *      1111 1111 1111 1111 1111 1111 0000 1001
         * 反码转源码
         *      1000 0000 0000 0000 0000 0000 1111 0110
         * -246
         */

        System.out.println((~-245));
        /**
         * 计算过程
         * -245：1000 0000 0000 0000 0000 0000 1111 0101
         * 反码： 1111 1111 1111 1111 1111 1111 0000 1010
         * 补码： 1111 1111 1111 1111 1111 1111 0000 1011
         * 按位取反
         *       0000 0000 0000 0000 0000 0000 1111 0100
         *       244
         *
         */
    }
}
